weissRecipesApp.controller('recipeController', ['$scope', '$stateParams', function($scope, $stateParams) {


  $scope.id = $stateParams.recipeID;
  $scope.material ="  ל-4 מנות:,1 גב עול כרישה פרוס,1 ב    צל חת   לקוביות,2 גבעולי סלרי פרוסים,2 גזרים חתוכים לקוביות,2 כפות שמן זית או חמאה,1 כוס קוביות דלעת,2 קישואים חתוכים לקוביות,טימין,2 כוסות מיץ עגבניות,מלח ופלפל שחור גרוס,3-2 כוסות מים";

$scope.preparation = "מחממים סיר גדול עם שמן זית או חמאה ומאדים את ירקות השורש כ-3 דקות. מוסיפים את הדלעת והקישואים ומערבבים יחד עוד דקה-שתיים" +
"מוסיפים את מיץ העגבניות, מתבלים ומוסיפים מים לפי הצורך – לא יותר מדי, שהטעמים לא יתפוגגו ולא פחות מדי כדי שלא יתקבל נזיד. אם מתכננים להוסיף אורז או דגן אחר חייבים יותר מים."+
"מבשלים 30 דקות או עד שהירקות רכים וטעמם מורגש בנוזלים. טועמים ומוסיפים תיבול – עוד הצעות לתיבולים בהמשך.";
}]);
